- ## *.head()*
- ## *.tail()*
- ## *.at[]*
- ## *.iat[]*
- ## *.loc[]*
- ## *.iloc[]*
- ## *.items()*
- ## *.keys()*
- ## *.iterrows()*
- ## *.xs()* 
- ## *.get()*
- ## *.isin()*
- ## *.where()*
- ## *.np.where*
- ## *.mask()*
- ## *.query()*
- ## *.set_index()*

# *.head()*
<br>

- ### Return the first n rows.

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("datasets/subs.csv")
df

     Subscribers gained
0                    48
1                    57
2                    40
3                    43
4                    44
..                  ...
360                 231
361                 226
362                 155
363                 144
364                 172

[365 rows x 1 columns]

In [3]:
df.head() # BY default 5 no of rows

   Subscribers gained
0                  48
1                  57
2                  40
3                  43
4                  44

In [4]:
df.head(3) # change no of rows

   Subscribers gained
0                  48
1                  57
2                  40

# *.tail()*
<br>

- ### Return the last n rows.

In [5]:
df.tail() # BY default 5 no of rows

     Subscribers gained
360                 231
361                 226
362                 155
363                 144
364                 172

In [6]:
df.tail(3) # change no of rows

     Subscribers gained
362                 155
363                 144
364                 172

# *.at[index no, col]*
<br>


- ### Access a single value for a row/column label pair.

In [7]:
df.head()

   Subscribers gained
0                  48
1                  57
2                  40
3                  43
4                  44

In [8]:
df.at[0,"Subscribers gained"]

48

In [9]:
df.at[1,"Subscribers gained"]

57

In [10]:
df.at[1,"Subscribers gained"] = 0 # also change to value

In [11]:
df.at[1,"Subscribers gained"]

0

# *.iat[index no, label no]*
<br>

- ### Access a single value for a row/column pair by integer position.

In [12]:
df.head()

   Subscribers gained
0                  48
1                   0
2                  40
3                  43
4                  44

In [13]:
df.iat[0,0]

48

In [14]:
df.iat[1,0]

0

In [15]:
df.iat[2,0]

40

In [16]:
df.iat[-1,0]

172

# *.loc[]*
<br>

- ### Access a group of rows and columns by label(s) or a boolean array.

In [17]:
data = {
    "name":["Ali","Ahmad","bilal","Khalid","Umer"],
    "marks":[50,30,49,45,60]
}
dt = pd.DataFrame(data,index=data["name"])  # change indexing with names
dt

          name  marks
Ali        Ali     50
Ahmad    Ahmad     30
bilal    bilal     49
Khalid  Khalid     45
Umer      Umer     60

In [18]:
dt.loc["Ali"] # access

name     Ali
marks     50
Name: Ali, dtype: object

In [19]:
dt.loc["Ali":] # slicing

          name  marks
Ali        Ali     50
Ahmad    Ahmad     30
bilal    bilal     49
Khalid  Khalid     45
Umer      Umer     60

In [20]:
dt.loc["Ali":"Khalid"] # slicing

          name  marks
Ali        Ali     50
Ahmad    Ahmad     30
bilal    bilal     49
Khalid  Khalid     45

In [21]:
dt.loc["Ali":"Umer":2] # skipping

        name  marks
Ali      Ali     50
bilal  bilal     49
Umer    Umer     60

# *.iloc[]*
<br>

- ### Purely integer-location based indexing for selection by position.

In [22]:
dt = pd.DataFrame(data)  # change indexing with names
dt

     name  marks
0     Ali     50
1   Ahmad     30
2   bilal     49
3  Khalid     45
4    Umer     60

In [23]:
dt.iloc[0]

name     Ali
marks     50
Name: 0, dtype: object

In [24]:
dt.iloc[0:]

     name  marks
0     Ali     50
1   Ahmad     30
2   bilal     49
3  Khalid     45
4    Umer     60

In [25]:
dt.iloc[0:4] # slicing

     name  marks
0     Ali     50
1   Ahmad     30
2   bilal     49
3  Khalid     45

In [26]:
dt.iloc[0:4:2] # skipping

    name  marks
0    Ali     50
2  bilal     49

# *.items()*
<br>

- ### Iterate over DataFrame rows as (index, Series) pairs.

In [27]:
dt.items()

In [28]:
for label, content in dt.items():
    print(f'label: {label}')
    print(f'\ncontent: {content}', sep='\n')

label: name

content: 0       Ali
1     Ahmad
2     bilal
3    Khalid
4      Umer
Name: name, dtype: object
label: marks

content: 0    50
1    30
2    49
3    45
4    60
Name: marks, dtype: int64

# *.keys()*
<br>

- ### Get the info axis

In [29]:
dt.keys()

Index(['name', 'marks'], dtype='object')

In [30]:
for i in dt.keys():
    print(i)

name
marks

#  .*iterrows*
<br>

- ### Iterate over DataFrame rows as (index, Series) pairs.

In [31]:
dt.iterrows()

In [32]:
for i in dt.iterrows():
    print(i)

(0, name     Ali
marks     50
Name: 0, dtype: object)
(1, name     Ahmad
marks       30
Name: 1, dtype: object)
(2, name     bilal
marks       49
Name: 2, dtype: object)
(3, name     Khalid
marks        45
Name: 3, dtype: object)
(4, name     Umer
marks      60
Name: 4, dtype: object)

In [33]:
for k,v in dt.iterrows():
    print(k)

0
1
2
3
4

In [34]:
for k,v in dt.iterrows():
    print(v)

name     Ali
marks     50
Name: 0, dtype: object
name     Ahmad
marks       30
Name: 1, dtype: object
name     bilal
marks       49
Name: 2, dtype: object
name     Khalid
marks        45
Name: 3, dtype: object
name     Umer
marks      60
Name: 4, dtype: object

## .xs
<br>

- ### Return cross-section from the Series/DataFrame.

In [35]:
import pandas as pd

# Sample DataFrame
data = {'Name': ['Ali', 'Ahmed', 'Sara', 'Maryam'],
        'Age': [20, 25, 30, 35],
        'City': ['Karachi', 'Lahore', 'Islamabad', 'Quetta']}

df = pd.DataFrame(data)
df = df.set_index('Name')

df

        Age       City
Name
Ali      20    Karachi
Ahmed    25     Lahore
Sara     30  Islamabad
Maryam   35     Quetta

In [36]:
# Selecting a row with label 'Ali'
df.xs('Ali')

Age          20
City    Karachi
Name: Ali, dtype: object

In [37]:
import pandas as pd

# Sample DataFrame
data = {'Name': ['Ali', 'Ahmed', 'Sara', 'Maryam'],
        'Age': [20, 25, 30, 35],
        'City': ['Karachi', 'Lahore', 'Islamabad', 'Quetta']}

df = pd.DataFrame(data)
df

     Name  Age       City
0     Ali   20    Karachi
1   Ahmed   25     Lahore
2    Sara   30  Islamabad
3  Maryam   35     Quetta

In [58]:
df.xs("Name",axis=1) #axis 1 required for series

0       Ali
1     Ahmed
2      Sara
3    Maryam
Name: Name, dtype: object

## multi-level index

In [88]:
import pandas as pd

data = {'Name': ['Ali', 'Ali', 'Ahmed', 'Ahmed', 'Sara', 'Sara'],
        'Exam': ['Mid', 'Final', 'Mid', 'Final', 'Mid', 'Final'],
        'Maths': [75, 80, 85, 90, 95, 100],
        'Science': [80, 85, 90, 95, 100, 105]}

df = pd.DataFrame(data)
df

    Name   Exam  Maths  Science
0    Ali    Mid     75       80
1    Ali  Final     80       85
2  Ahmed    Mid     85       90
3  Ahmed  Final     90       95
4   Sara    Mid     95      100
5   Sara  Final    100      105

In [89]:
df = df.set_index(['Name', 'Exam'])
df

             Maths  Science
Name  Exam
Ali   Mid       75       80
      Final     80       85
Ahmed Mid       85       90
      Final     90       95
Sara  Mid       95      100
      Final    100      105

In [90]:
df.xs(('Ali', 'Final')) # get Ali -> Final

Maths      80
Science    85
Name: (Ali, Final), dtype: int64

In [91]:
df.xs(('Ali', 'Mid')) # get Ali -> Mid

Maths      75
Science    80
Name: (Ali, Mid), dtype: int64

## .get()
<br>

- ### Get item from object for given key (ex: DataFrame column).

In [92]:
df = pd.DataFrame(data)
df

    Name   Exam  Maths  Science
0    Ali    Mid     75       80
1    Ali  Final     80       85
2  Ahmed    Mid     85       90
3  Ahmed  Final     90       95
4   Sara    Mid     95      100
5   Sara  Final    100      105

In [93]:
df.get("Science")

0     80
1     85
2     90
3     95
4    100
5    105
Name: Science, dtype: int64

In [96]:
df.get("Science").get(5)

105

In [98]:
df.get("Science").get(6,default="Not Found")

'Not Found'

## .isin()
<br>

- ### Whether each element in the DataFrame is contained in values.

In [100]:
data = {'Name': ['Ali', 'Ahmed', 'Sara', 'Maryam'],
        'Age': [20, 25, 30, 35],
        'City': ['Karachi', 'Lahore', 'Islamabad', 'Quetta']}

df = pd.DataFrame(data)
df

     Name  Age       City
0     Ali   20    Karachi
1   Ahmed   25     Lahore
2    Sara   30  Islamabad
3  Maryam   35     Quetta

In [104]:
df['City'].isin(['Karachi', 'Lahore'])

0     True
1     True
2    False
3    False
Name: City, dtype: bool

In [105]:
df[df['City'].isin(['Karachi', 'Lahore'])]

    Name  Age     City
0    Ali   20  Karachi
1  Ahmed   25   Lahore

## .where()
<br>

- ### Replace values where the condition is False.

In [116]:
df = pd.DataFrame({'A': [1, 2, 3, 4, 5],
                   'B': [6, 7, 8, 9, 10],
                   'C': [11, 12, 13, 14, 15]})

df

   A   B   C
0  1   6  11
1  2   7  12
2  3   8  13
3  4   9  14
4  5  10  15

In [118]:

df.where(df > 5, 0)

   A   B   C
0  0   6  11
1  0   7  12
2  0   8  13
3  0   9  14
4  0  10  15

In [123]:
# also use np.where for both conditions
import numpy as np
np.where(df > 5,"Greater","Shorter")

array([['Shorter', 'Greater', 'Greater'],
       ['Shorter', 'Greater', 'Greater'],
       ['Shorter', 'Greater', 'Greater'],
       ['Shorter', 'Greater', 'Greater'],
       ['Shorter', 'Greater', 'Greater']], dtype='<U7')

## .mask()
<br>

- ### Replace values where the condition is True.

In [124]:
df = pd.DataFrame({'A': [1, 2, 3, 4, 5],
                   'B': [6, 7, 8, 9, 10],
                   'C': [11, 12, 13, 14, 15]})

df

   A   B   C
0  1   6  11
1  2   7  12
2  3   8  13
3  4   9  14
4  5  10  15

In [126]:
df.mask(df < 8)

    A     B   C
0 NaN   NaN  11
1 NaN   NaN  12
2 NaN   8.0  13
3 NaN   9.0  14
4 NaN  10.0  15

In [127]:
df.mask(df < 8, -1) # same as np.where

   A   B   C
0 -1  -1  11
1 -1  -1  12
2 -1   8  13
3 -1   9  14
4 -1  10  15

## *.query()*
<br>

- ### Query the columns of a DataFrame with a boolean expression.

In [130]:
import pandas as pd

df = pd.DataFrame({'A': [1, 2, 3, 4, 5],
                   'B': [6, 7, 8, 9, 10],
                   'C': [11, 12, 13, 14, 15]})
df

   A   B   C
0  1   6  11
1  2   7  12
2  3   8  13
3  4   9  14
4  5  10  15

In [131]:
df.query('A > 2 and A < 5')

   A  B   C
2  3  8  13
3  4  9  14

In [132]:
min_val = 2
max_val = 5

df.query('A > @min_val and A < @max_val')

   A  B   C
2  3  8  13
3  4  9  14

- ### .set_index()

In [133]:
df

   A   B   C
0  1   6  11
1  2   7  12
2  3   8  13
3  4   9  14
4  5  10  15

In [134]:
df.set_index("B")

    A   C
B
6   1  11
7   2  12
8   3  13
9   4  14
10  5  15